import math
eps = 0.000001
n = 1
x = float(input("значение х:"))
sum = 0
s0=1
if x >-1 and x<1: #перевіряємо чи буде зведений ряд
    while abs(sum-s0)>=eps: #виконується доки різниця теперішньої суми та попередньої за модулем більше eps
        s0 = sum
        s = ((-1)**(n+1))*((x**(n-1))/n)
        sum = s0+s
        n +=1
        print("значення модуля різниці: ", '{0:3.17f}'.format(abs(sum-s0)))
    print("Сума дорівнює: ",'{0:3.17f}'.format(sum))
    print("Вираз за цієї точності дорівнює:", '{0:3.17f}'.format(s))
else:
    print("Ряд не зведений")
